Update Readme
Update Readme with 2 diagrams using mermaid tool (easier to preview)
